SE4Foam/tutorials/simple4SEFoam/porousPTC/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Da = 0.1 -> K = d^2/Da = 15.625
//F = sqrt(1/K) * ce(=0.2439) = 0.964

1
(
    porousRing
    {
        porosity    0.2;

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (15.625 15.625 15.625);
            f   f [0 -1 0 0 0 0 0] (0.964 0.964 0.964);
        }

        thermalProperties
        {
            rho		rho [1 -3 0 0 0 0 0]		8933;
            Cp		Cp [0 2 -2 -1 0 0 0]		385;
            kappa	kappa [ 1 1 -3 -1 0 0 0 ]	401;
        }
    }
)


// ************************************************************************* //
