SE4Foam/tutorials/simple4SEFoam/porousPTC/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  SE4Foam;

Prt		Prt [ 0 0 0 0 0 0 0 ]		0.85;
Pr              Pr [0 0 0 0 0 0 0]		10.87;

//fluidConstProp    constProp    coeffs    166.0    1056    0.1353    1575.0    3.28e-3; //T = 300K nu = 3.1e-6
fluidConstProp    constProp    coeffs    166.0    975.7    0.1242    1851.0    7.3e-4; //T = 400K nu = 7.48e-7, alpha = 6.88e-8, Pr = 10.87
/*
//285 < T < 693 K in liquid phase
fluidFuncTProp
{
    type           funcTProp;
    constCoeffs    166.0;
    rhoCoeffs      1.4386e+03    -1.8711e+00    2.737e-03    -2.3793e-06    0.0    0.0    0.0    0.0    0.0;
    kappaCoeffs    0.14644    2.0353e-05    -1.9367e-07    1.0614e-11    0.0    0.0    0.0    0.0    0.0;
    CpCoeffs       2.125e+03    -11.017    0.049862    -7.7663e-05    4.394e-08    0.0    0.0    0.0    0.0;
    muCoeffs       4.15    0.0    0.0    0.0    0.0    0.0    0.0    -2.363e-02    2.5847e-04;
}
*/
// ************************************************************************* //
