SE4Foam/tutorials/simple4SEFoam/porousPTC/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 400;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 400;
    }

    outlet
    {
        type            zeroGradient;
    }

    tubeWall
    {
        type		parabolicCollector4SEFoam;
        Kappa		kappaEff;
        range		(0 68 114 180);
        LCR1		(26.65    -0.01496    0.04643    -2.258e-3    4.175e-5    -2.588e-7);
        LCR2		(-181.1    9.099    -0.1121    4.071e-4    0.0    0.0);
        LCR3		(9.668    -0.1821    1.125e-3    -2.157e-6    0.0    0.0);
        glassRadProp	(0.01    0.02    0.97);//(Absorptivity  emissivity transmissivity)
        tubeRadProp	(0.96    0.04    0.0);//(Absorptivity  emissivity transmissivity)
        dgi		0.12;
        dgo		0.125;
        dti		0.076;
        dto		0.08;
        len		5.0;
        longDir		(0 1 0);
        radDir		(0 0 -1);
        qo		(1000);
        ho		(9.6);
        To		(300);
    }
}

// ************************************************************************* //
